# Создаем карту игрового поля
maps = [[' ', 1, 2, 3],
        [1, ' ', ' ', ' '],
        [2, ' ', ' ', ' '],
        [3, ' ', ' ', ' ']]

print('Игровое поле:')  #Объяснение правил
for i in maps:
    for j in i:
        print(j, end='|')
    print()
print('____________________')
print('Ход начинает игрок № 1, играющий за крестики (х) ')
print(
    'Каждый игрок указывает ход, введя координаты точки следующим образом: №столбца №строки (через пробел)')
print('Пример хода:')
print('1 2')
print('____________________')
count = 0  # Счетчик ходов, макс количество ходов - 9 (3х3, по размеру поля)
win = 0  # Зададим переменную "победa", чтобы не было конфликта, когда победа происходит на последнем ходе (ход 9)
while count <= 9:  # проверка количества ходов
    if count == 9 and win != 1:  # проверка победы на последнем ходе
        print('Игра окончена - ничья!')
        count += 1
        break
    if count % 2 == 0 and count != 9:  # Если четный ход, начиная с 0, то ходит игрок № 1 (X)
        n = list(map(int, input(
            'Игрок №1, введите координаты для X через пробел:').split()))
        if n[0] > 3 or n[0] < 1 or n[1] > 3 or n[1] < 1:  # Проверка верности координат
            print('Вне координат! Введите корректные значения!')
            continue
        if maps[n[1]][n[0]] == '0' or maps[n[1]][n[0]] == 'x':  # Проверка занятости координат
            print('Ячейка занята! Выберите другие координаты!')
            continue
        maps[n[1]][n[0]] = "x"  # Отображение игрового поля с записанным ходом
        count += 1
        for i in maps:
            for j in i:
                print(j, end='|')
            print()
        if (maps[1][1] == 'x' and maps[2][2] == 'x' and maps[3][3] == 'x') or (  # проверка выигрышных комбинаций
                maps[1][1] == 'x' and maps[2][1] == 'x' and maps[3][1] == 'x') or (
                maps[1][2] == 'x' and maps[2][2] == 'x' and maps[3][2] == 'x') or (
                maps[1][3] == 'x' and maps[2][3] == 'x' and maps[3][3] == 'x') or (
                maps[1][1] == 'x' and maps[1][2] == 'x' and maps[1][3] == 'x') or (
                maps[2][1] == 'x' and maps[2][2] == 'x' and maps[2][3] == 'x') or (
                maps[3][1] == 'x' and maps[3][2] == 'x' and maps[3][3] == 'x') or (
                maps[3][1] == 'x' and maps[2][2] == 'x' and maps[1][3] == 'x'):
            print('Победил игрок № 1, крестики!')
            break
            count = 9  # Если победа - принудительное закрытие счетчика и засчитывание победы в переменную
            win += 1
    if count % 2 != 0 and count != 9:  # Нечетный ход - для игрока №2 (0)
        n = list(map(int, input('Игрок №2, введите координаты для 0 через пробел:').split()))
        if n[0] > 3 or n[0] < 1 or n[1] > 3 or n[1] < 1: #проверки координат
            print('Вне координат! Введите корректные значения!')
            continue
        if maps[n[1]][n[0]] == '0' or maps[n[1]][n[0]] == 'x':
            print('Ячейка занята! Выберите другие координаты!')
            continue
        maps[n[1]][n[0]] = '0'
        count += 1
        for i in maps:
            for j in i:
                print(j, end='|')
            print()
        if (maps[1][1] == '0' and maps[2][2] == '0' and maps[3][3] == '0') or (
                maps[1][1] == '0' and maps[2][1] == '0' and maps[3][1] == '0') or (
                maps[1][2] == '0' and maps[2][2] == '0' and maps[3][2] == '0') or (
                maps[1][3] == '0' and maps[2][3] == '0' and maps[3][3] == '0') or (
                maps[1][1] == '0' and maps[2][1] == '0' and maps[3][1] == '0') or (
                maps[2][1] == '0' and maps[2][2] == '0' and maps[2][3] == '0') or (
                maps[3][1] == '0' and maps[3][2] == '0' and maps[3][3] == '0') or (
                maps[3][1] == '0' and maps[2][2] == '0' and maps[1][3] == '0'):
            print('Победил игрок № 2, нолики!')
            break
            count = 9
            win += 1
